def area(a, b):
    '''
        Возвращает площадь прямоугольника со сторонами a и b

            Параметры:
                a (int): одна сторона прямоугольника
                b (int): вторая сторона прямоугольника (не противоположная)

            Возвращаемое значение:
                a * b (int): площадь прямоугольника
    '''
    return a * b


def perimeter(a, b):
    '''
        Возвращает периметр прямоугольника со сторонами a и b

            Параметры:
                a (int): одна сторона прямоугольника
                b (int): вторая сторона прямоугольника (не противоположная)

            Возвращаемое значение:
                2*a + 2*b (int): периметр прямоугольника
    '''
    return 2*a + 2*b
